# Series
    - One dimensional labeled array
    - Has Exactly one dtype
    - Syntanx pd.Series(["data"],index=["Optional"])

In [1]:
import pandas as pd

In [2]:
pd.Series([1,2,3,4])
pd.Series([1,2,3,4],index=['a','b','c','d'])

a    1
b    2
c    3
d    4
dtype: int64

In [3]:
series=pd.Series([1,2,3,4],index=['a','b','c','d'],dtype="float",name="PythonSeries")
series

a    1.0
b    2.0
c    3.0
d    4.0
Name: PythonSeries, dtype: float64

In [4]:
type(series)

pandas.core.series.Series

In [5]:
series=pd.Series(12,index=[1,2,3,4])
series

1    12
2    12
3    12
4    12
dtype: int64

### Creating A Series Using Dictionary

In [6]:
dic={"Name":["Haroon","Abbas"],"Age":[20,32]}
series=pd.Series(dic)
series

Name    [Haroon, Abbas]
Age            [20, 32]
dtype: object

## Arithmetic Operaitons on Series

In [7]:
series1=pd.Series([10,20,30])
series2=pd.Series([30,20,10])

In [8]:
series1+series2

0    40
1    40
2    40
dtype: int64

In [9]:
series1-series2

0   -20
1     0
2    20
dtype: int64

In [10]:
series1*series2

0    300
1    400
2    300
dtype: int64

In [11]:
series1/series2

0    0.333333
1    1.000000
2    3.000000
dtype: float64

# DataFrame
    - Two Dimensional Data structure containing rows and columns, like table
    - A colleciton of Series
    - Each column is a series
    - Syntax: pd.DataFrame({"Name":["Haroon","Ali","John"]},index=['a','b','c'])
    - Columns can have different dtypes
    - Length of all columns should be same

In [12]:
df=pd.DataFrame({ "Name":["Haroon","Ali","John"],"Age":[20,32,12]},index=['a','b','c'])
df

     Name  Age
a  Haroon   20
b     Ali   32
c    John   12

### Creating DataFrame using List

In [13]:
lst=[1,2,3,4]
pd.DataFrame(lst)

lst=[[1,2,3,4,5],[6,7,8,9,10]]
pd.DataFrame(lst)

   0  1  2  3   4
0  1  2  3  4   5
1  6  7  8  9  10

In [14]:
type(df)

pandas.core.frame.DataFrame

### Creating DataFrame from Dictionary

In [15]:

dic={ "Name":["Haroon","Ali","John"],"Age":[20,32,12]}
df=pd.DataFrame(dic,columns=[ "Name"])
df

     Name
0  Haroon
1     Ali
2    John

### Creating DataFrame from Series

In [16]:

dicOfSeries={"s1":pd.Series([12,13,14]),"s2":pd.Series([15,16,17])}
pd.DataFrame(dicOfSeries)

   s1  s2
0  12  15
1  13  16
2  14  17

### Get Individual Columns

In [17]:
df["Name"]

0    Haroon
1       Ali
2      John
Name: Name, dtype: object

### Get Individual Row

In [18]:
df.iloc[0]
df.loc[0]

Name    Haroon
Name: 0, dtype: object

### Get Particular Cell

In [19]:
df["Name"][2]

'John'

## Arithmetic Operations on Data Frame

In [28]:
df=pd.DataFrame({ "Col1":[10,20,30,40],"Col2":[40,30,20,10]})
df

   Col1  Col2
0    10    40
1    20    30
2    30    20
3    40    10

### Sum

In [29]:
df["Sum"]=df["Col1"]+df["Col2"]
df

   Col1  Col2  Sum
0    10    40   50
1    20    30   50
2    30    20   50
3    40    10   50

### Difference

In [30]:
df["Difference"]=df["Col1"]-df["Col2"]
df

   Col1  Col2  Sum  Difference
0    10    40   50         -30
1    20    30   50         -10
2    30    20   50          10
3    40    10   50          30

### Product

In [31]:
df["Product"]=df["Col1"]*df["Col2"]
df

   Col1  Col2  Sum  Difference  Product
0    10    40   50         -30      400
1    20    30   50         -10      600
2    30    20   50          10      600
3    40    10   50          30      400

### Division

In [32]:
df["Division"]=df["Col1"]/df["Col2"]
df

   Col1  Col2  Sum  Difference  Product  Division
0    10    40   50         -30      400  0.250000
1    20    30   50         -10      600  0.666667
2    30    20   50          10      600  1.500000
3    40    10   50          30      400  4.000000

In [58]:
df=pd.DataFrame({ "Col1":[10,20,30,40,50,60],"Col2":[60,50,40,30,20,10]})
df

   Col1  Col2
0    10    60
1    20    50
2    30    40
3    40    30
4    50    20
5    60    10

### Inserting a Column in DataFrame

In [ ]:
df.insert(1,"Col3",[1,2,3,4,5,6])
df.insert(1,"Col3",df["Col1"])
df

   Col1  Col3  Col2
0    10    10    60
1    20    20    50
2    30    30    40
3    40    40    30
4    50    50    20
5    60    60    10

In [ ]:
# Using Slicing
df["Col4"]=df["Col3"][:4]
df

   Col1  Col3  Col2  Col4
0    10    10    60  10.0
1    20    20    50  20.0
2    30    30    40  30.0
3    40    40    30  40.0
4    50    50    20   NaN
5    60    60    10   NaN

### Deleting a Column in DataFrame

#### Using del Keyword

In [61]:
del df["Col4"]
df

   Col1  Col3  Col2
0    10    10    60
1    20    20    50
2    30    30    40
3    40    40    30
4    50    50    20
5    60    60    10

#### Using pop("ColName")

In [62]:
col3=df.pop("Col3")
col3

0    10
1    20
2    30
3    40
4    50
5    60
Name: Col3, dtype: int64

In [63]:
df

   Col1  Col2
0    10    60
1    20    50
2    30    40
3    40    30
4    50    20
5    60    10

## Practice Problems

In [ ]:
df=pd.DataFrame({ "Col":[10,20,30,40,50,60,70,80]})
df[">40"]=df["Col"] > 40
df["<40"]=df["Col"] < 40
df

   Col    >40    <40
0   10  False   True
1   20  False   True
2   30  False   True
3   40  False  False
4   50   True  False
5   60   True  False
6   70   True  False
7   80   True  False

üü¢ Level 1 ‚Äî Series Instincts

Q1

``
s = pd.Series([2, 4, 6, 8], index=['a', 'b', 'c', 'd'])
``


    1Ô∏è‚É£ Select values greater than 4
    2Ô∏è‚É£ Select values at labels 'b' and 'd'
    3Ô∏è‚É£ Multiply all values by 3
    4Ô∏è‚É£ What happens if you run: s['e']

In [ ]:
s=pd.Series([2,4,6,8],index=['a','b','c','d'])
# 1
s[s>4]

c    6
d    8
dtype: int64

In [ ]:
# 2
s[['b','d']]

b    4
d    8
dtype: int64

In [ ]:
# 3
s*3

a     6
b    12
c    18
d    24
dtype: int64

In [ ]:
# 4
s['e'] # Error

Q2 ‚Äî Index Alignment

    s1 = pd.Series([10, 20, 30], index=['a', 'b', 'c'])
    s2 = pd.Series([1, 2, 3], index=['b', 'c', 'd'])


1Ô∏è‚É£ Compute:
``
s1 + s2
``

In [81]:
s1 = pd.Series([10, 20, 30], index=['a', 'b', 'c'])
s2 = pd.Series([1, 2, 3], index=['b', 'c', 'd'])

s1+s2

a     NaN
b    21.0
c    32.0
d     NaN
dtype: float64

2Ô∏è‚É£ Why do NaN values appear?

This happens because Pandas aligns on Index, not position.

(Note how the integers turned into floats? That is because NaN is technically a float).

Q3 ‚Äî dtype Trap

s = pd.Series(['10', '20', '30'])


    1Ô∏è‚É£ What is s.dtype?
    2Ô∏è‚É£ Convert it to numeric properly
    3Ô∏è‚É£ Find the mean

In [ ]:
# 1
s=pd.Series(['10','20','30'])
s.dtype

dtype('O')

In [ ]:
#2
s=s.astype(int)
s.dtype

dtype('int64')

In [87]:
# 3
s.mean()

np.float64(20.0)

s.mean()

# Panel
    - 3 Dimensional Array